---
kind: method
id: M:Autodesk.Revit.DB.Analysis.GenericZone.GetDomainData
source: html/e57b169b-8d31-5334-0149-13519ccef584.htm
---
# Autodesk.Revit.DB.Analysis.GenericZone.GetDomainData Method

Gets the domain data for the generic zone.

## Syntax (C#)
```csharp
public GenericZoneDomainData GetDomainData()
```

## Returns
Returns a pointer to the base class for specific domain requirements for the generic zone.